# ProgressDlgYield

## Description
Increases the progress. This must be called between ProgressDlgStart and ProgressDlgEnd and defines the LoopCount index.

```pascal
PROCEDURE ProgressDlgYield(count : LONGINT);
```

```python

def vs.ProgressDlgYield(count):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|count|LONGINT||

## Version
Availability: from Vectorworks 2015
## Category
* Utility